export interface Settings {
    Home?: {
    /**
         * [首页] 启用自定义功能
         *
         * 启用后可自定义首页顶栏、标签页和底部导航栏内容。标签页由分区页的快捷访问决定。
         *
         * @defaultValue true
         */
        Switch?: boolean;
    /**
         * [首页] 标签页
         *
         * 这里只列出常用选项；分区页提供接近60个快捷访问选项，无法在模块参数中完整列出。请前往 BiliBili App 分区页，使用原生“快捷访问”功能自定义首页标签页。
         *
         * @remarks
         *
         * Possible values:
         * - `'2036'` - 直播
         * - `'2037'` - 推荐
         * - `'780'` - 热门
         * - `'545'` - 番剧
         * - `'774'` - 动画（港澳台）
         * - `'151'` - 影视
         * - `'801'` - 韩综（港澳台）
         * - `'2280'` - 校园
         *
         * @defaultValue ["2036","2037","780","545","151"]
         */
        Tab?: ('2036' | '2037' | '780' | '545' | '774' | '151' | '801' | '2280')[];
    /**
         * [首页] 默认标签页
         *
         * 请选择启动APP时默认展示的标签页，需先将该标签页加入分区页的快捷访问。
         *
         * @remarks
         *
         * Possible values:
         * - `'2036'` - 直播
         * - `'2037'` - 推荐
         * - `'780'` - 热门
         * - `'545'` - 番剧
         * - `'774'` - 动画（港澳台）
         * - `'151'` - 影视
         * - `'801'` - 韩综（港澳台）
         * - `'2280'` - 校园
         *
         * @defaultValue "2037"
         */
        Tab_default?: '2036' | '2037' | '780' | '545' | '774' | '151' | '801' | '2280';
    /**
         * [首页] 顶栏（左侧）按钮（用户头像）
         *
         * 请选择顶栏（左侧）按钮（用户头像）的作用（在biliBili粉色版中无法修改）。
         *
         * @remarks
         *
         * Possible values:
         * - `'mine'` - 用户中心-我的
         * - `'videoshortcut'` - 短视频
         *
         * @defaultValue "mine"
         */
        Top_left?: 'mine' | 'videoshortcut';
    /**
         * [首页] 顶栏（右侧）按钮
         *
         * 请选择启用的顶栏（右侧）按钮。
         *
         * @remarks
         *
         * Possible values:
         * - `'game_center'` - 游戏中心
         * - `'mall'` - 会员购
         * - `'messages'` - 消息
         *
         * @defaultValue ["messages"]
         */
        Top?: ('game_center' | 'mall' | 'messages')[];
    /**
         * [首页] 标签栏右侧按钮
         *
         * 请选择启用的首页标签栏右侧按钮。
         *
         * @remarks
         *
         * Possible values:
         * - `'categories'` - 更多分区
         * - `'search'` - 搜索
         *
         * @defaultValue ["categories","search"]
         */
        Top_more?: ('categories' | 'search')[];
};
    /**
     * [底部] 导航栏按钮
     *
     * 请选择启用的底部导航栏按钮，最多6个。
     *
     * @remarks
     *
     * Possible values:
     * - `'home'` - 首页
     * - `'dynamic'` - 动态
     * - `'publish'` - 发布
     * - `'ogv'` - 节目（港澳台）
     * - `'mall'` - 会员购
     * - `'messages'` - 消息
     * - `'mine'` - 我的
     *
     * @defaultValue ["home","dynamic","ogv","mall","mine"]
     */
    Bottom?: ('home' | 'dynamic' | 'publish' | 'ogv' | 'mall' | 'messages' | 'mine')[];
    Region?: {
    /**
         * [分区] 启用此标签页自定义功能
         *
         * 启用后可自定义分区标签页的内容。
         *
         * @defaultValue true
         */
        Switch?: boolean;
    /**
         * [分区] 分区选择
         *
         * 选择要显示的分区。
         *
         * @remarks
         *
         * Possible values:
         * - `'1'` - 动画
         * - `'3'` - 音乐
         * - `'4'` - 游戏
         * - `'5'` - 娱乐
         * - `'11'` - 电视剧
         * - `'13'` - 番剧
         * - `'23'` - 电影
         * - `'36'` - 知识
         * - `'119'` - 鬼畜
         * - `'129'` - 舞蹈
         * - `'155'` - 时尚
         * - `'160'` - 生活
         * - `'167'` - 国创
         * - `'177'` - 纪录片
         * - `'181'` - 影视
         * - `'188'` - 科技
         * - `'202'` - 资讯
         * - `'211'` - 美食
         * - `'217'` - 动物圈
         * - `'223'` - 汽车
         * - `'234'` - 运动
         * - `'6544'` - 番劇(港澳台)
         * - `'65537'` - 直播
         * - `'65539'` - 游戏中心
         * - `'65541'` - 专栏
         * - `'65545'` - 放映厅
         * - `'65549'` - 工房集市
         * - `'65550'` - 游戏赛事
         * - `'65551'` - 小黑屋
         * - `'65552'` - 全区排行榜
         * - `'65553'` - 活动中心
         * - `'65555'` - 漫画
         * - `'65556'` - 原創排行榜
         * - `'65557'` - 公开课
         * - `'65559'` - VLOG
         * - `'65560'` - 课堂
         * - `'65561'` - 专题中心
         * - `'65563'` - 新歌热榜
         * - `'95636'` - 韩综(港澳台)
         * - `'168312'` - 節目(港澳台)
         *
         * @defaultValue ["1","3","4","5","11","13","23","36","119","129","155","160","167","177","181","188","202","211","217","223","234","6544","65537","65539","65541","65545","65549","65550","65551","65552","65553","65555","65556","65557","65559","65560","65561","65563","95636","168312"]
         */
        Index?: ('1' | '3' | '4' | '5' | '11' | '13' | '23' | '36' | '119' | '129' | '155' | '160' | '167' | '177' | '181' | '188' | '202' | '211' | '217' | '223' | '234' | '6544' | '65537' | '65539' | '65541' | '65545' | '65549' | '65550' | '65551' | '65552' | '65553' | '65555' | '65556' | '65557' | '65559' | '65560' | '65561' | '65563' | '95636' | '168312')[];
};
    Mine?: {
    /**
         * [我的] 启用此标签页自定义功能
         *
         * 启用后可自定义我的标签页的服务内容。
         *
         * @defaultValue true
         */
        Switch?: boolean;
    /**
         * [我的] 快捷入口
         *
         * @remarks
         *
         * Possible values:
         * - `'494'` - 离线缓存
         * - `'495'` - 历史记录
         * - `'4001'` - 我的收藏
         * - `'3084'` - 稍后再看
         *
         * @defaultValue ["494","495","4001","3084"]
         */
        Shortcuts?: ('494' | '495' | '4001' | '3084')[];
    /**
         * [我的] 创作中心
         *
         * 当前公开选项以国内版 APP 为准（未单独注明的选项皆为 iOS 版本）。
         *
         * @remarks
         *
         * Possible values:
         * - `'171'` - 创作中心
         * - `'172'` - 稿件管理
         * - `'533'` - 数据中心
         * - `'174'` - 有奖活动
         * - `'707'` - 主播中心
         * - `'708'` - 主播活动
         * - `'709'` - 开播福利
         * - `'710'` - 我的直播
         *
         * @defaultValue []
         */
        CreatorCenter?: ('171' | '172' | '533' | '174' | '707' | '708' | '709' | '710')[];
    /**
         * [我的] 推荐服务
         *
         * 白色版本 APP 不存在此选项。
         *
         * @remarks
         *
         * Possible values:
         * - `'400'` - 我的课程
         * - `'401'` - 看视频免流量
         * - `'402'` - 个性装扮
         * - `'3994'` - 我的钱包
         * - `'403'` - 游戏中心
         * - `'406'` - 直播中心
         * - `'423'` - 邀好友赚红包
         * - `'514'` - 社区中心
         * - `'544'` - 创作中心
         * - `'622'` - 会员购中心
         * - `'924'` - 哔哩哔哩公益
         * - `'990'` - 能量加油站
         *
         * @defaultValue ["400","402","3994","403"]
         */
        Recommend?: ('400' | '401' | '402' | '3994' | '403' | '406' | '423' | '514' | '544' | '622' | '924' | '990')[];
    /**
         * [我的] 更多服务
         *
         * @remarks
         *
         * Possible values:
         * - `'4021'` - 联系客服
         * - `'4022'` - 设置
         * - `'742'` - 稿件管理（白色版）
         * - `'812'` - 听视频
         * - `'950'` - 青少年模式（概念版）
         * - `'964'` - 青少年守护
         * - `'1028'` - 我的NFT
         *
         * @defaultValue ["4021","4022","1028"]
         */
        More?: ('4021' | '4022' | '742' | '812' | '950' | '964' | '1028')[];
    iPad?: {
        /**
         * [我的 iPad版] 启用此标签页自定义功能
         *
         * 启用后可自定义iPad版我的标签页的服务内容。
         *
         * @defaultValue true
         */
        Switch?: boolean;
        /**
         * [我的 iPad版] 创作中心
         *
         * 白色版本 APP 不存在此选项。
         *
         * @remarks
         *
         * Possible values:
         * - `'785'` - 投稿
         * - `'786'` - 创作首页
         * - `'787'` - 稿件管理
         * - `'788'` - 有奖活动
         *
         * @defaultValue []
         */
        Upper?: ('785' | '786' | '787' | '788')[];
        /**
         * [我的 iPad版] 推荐服务
         *
         * 白色版本 APP 不存在此选项。
         *
         * @remarks
         *
         * Possible values:
         * - `'789'` - 我的关注
         * - `'790'` - 我的消息
         * - `'791'` - 我的钱包
         * - `'792'` - 直播中心
         * - `'793'` - 大会员
         * - `'794'` - 我的课程
         * - `'2542'` - 我的游戏
         *
         * @defaultValue ["789","790","791","793","794","2542"]
         */
        Recommend?: ('789' | '790' | '791' | '792' | '793' | '794' | '2542')[];
        /**
         * [我的 iPad版] 更多服务
         *
         * @remarks
         *
         * Possible values:
         * - `'797'` - 我的客服
         * - `'798'` - 设置
         * - `'1070'` - 青少年守护
         *
         * @defaultValue ["797","798"]
         */
        More?: ('797' | '798' | '1070')[];
};
};
    /**
     * [储存] 配置类型
     *
     * 默认使用 PersistentStore，配置优先级为 database -> $argument -> PersistentStore (BoxJs)；选择 Argument 时为 database -> PersistentStore (BoxJs) -> $argument。
     *
     * @remarks
     *
     * Possible values:
     * - `'Argument'` - 优先使用 $argument，其次使用 PersistentStore (BoxJs)，最后使用 database.mjs 的默认配置
     * - `'PersistentStore'` - 优先使用 PersistentStore (BoxJs)，其次使用 $argument，最后使用 database.mjs 的默认配置
     * - `'database'` - 只使用由作者的 database.mjs 文件提供的默认配置，其他任何自定义配置不再起作用
     *
     * @defaultValue "PersistentStore"
     */
    Storage?: 'Argument' | 'PersistentStore' | 'database';
    /**
     * [调试] 日志等级
     *
     * 选择脚本日志的输出等级，低于所选等级的日志将全部输出。
     *
     * @remarks
     *
     * Possible values:
     * - `'OFF'` - 关闭
     * - `'ERROR'` - ❌ 错误
     * - `'WARN'` - ⚠️ 警告
     * - `'INFO'` - ℹ️ 信息
     * - `'DEBUG'` - 🅱️ 调试
     * - `'ALL'` - 全部
     *
     * @defaultValue "WARN"
     */
    LogLevel?: 'OFF' | 'ERROR' | 'WARN' | 'INFO' | 'DEBUG' | 'ALL';
}
